STMicroelectronics/STM32CubeWB/Projects/STM32WB5MM-DK/Applications/Zigbee/Zigbee_TempMeas_Client_Router/STM32_WPAN/App/app_zigbee.c
  readReq.count = 1U;
  readReq.attr[0]=ZCL_TEMP_MEAS_ATTR_MEAS_VAL ;
   
  APP_DBG("[TEMP MEAS] Triggered a Read Coordinator Temp Attributes");
  if(ZbZclReadReq(zigbee_app_info.temp_meas_client, &readReq, APP_ZIGBEE_Temp_Meas_Read_cb,zigbee_app_info.temp_meas_client) != ZCL_STATUS_SUCCESS)
  {
    APP_DBG("[TEMP MEAS] Error, ZbZclReadReq failed (SW1_ENDPOINT)");
    APP_ZIgbee_Error_Cnt++;
    UTIL_LCD_ClearStringLine(3);
    UTIL_LCD_DisplayStringAt(0, LINE(3), (uint8_t *) "READ ERR", CENTER_MODE);
    BSP_LCD_Refresh(0);
    APP_Zigbee_Display_ErrorCnt();
  }
  
}/*APP_ZIGBEE_Read_Temp_Attribute*/

            



 /**
 * @brief  Read OTA temp attribute callback
 * @param  read rsp
 * @retval None
 */
static void APP_ZIGBEE_Temp_Meas_Read_cb(const ZbZclReadRspT *readRsp, void *arg)
{
  int i;
  int16_t current_temp_attr;
  float current_temp;
  char text[32];
  aPwmLedGsData_TypeDef aPwmLedGsData;
  aPwmLedGsData[PWM_LED_RED] = PWM_LED_GSDATA_7_0;
  aPwmLedGsData[PWM_LED_GREEN] = PWM_LED_GSDATA_OFF;
  aPwmLedGsData[PWM_LED_BLUE] = PWM_LED_GSDATA_OFF;
 
  if (readRsp->count == 0)
  {
     APP_ZIgbee_Error_Cnt++;
     APP_DBG("[TEMP MEAS] Error, No attribute read");
     UTIL_LCD_ClearStringLine(3);
     UTIL_LCD_DisplayStringAt(0, LINE(3), (uint8_t *) "READ NO ATTR ERR", CENTER_MODE);
     BSP_LCD_Refresh(0);
     LED_On(aPwmLedGsData);
     APP_Zigbee_Display_ErrorCnt();
  }
  else
  {
    for(i=0;i<readRsp->count;i++)
    {
      if(readRsp->attr[i].status == ZCL_STATUS_SUCCESS)
      {
        switch(readRsp->attr[i].attrId)
        {
        case ZCL_TEMP_MEAS_ATTR_MEAS_VAL:
          current_temp_attr = pletoh16(readRsp->attr[i].value);
          current_temp = (float)current_temp_attr/100;
          APP_DBG("[TEMP MEAS] Current Temp= %.1f C",(float)current_temp);
          sprintf(text,"Remote T:%.1f C",current_temp);
          UTIL_LCD_ClearStringLine(3);
          UTIL_LCD_DisplayStringAt(0, LINE(3), (uint8_t *)text, CENTER_MODE);
          BSP_LCD_Refresh(0);
          break;
     
        default:
          break;
        }
      }
      else
      {
        APP_ZIgbee_Error_Cnt++;
        APP_DBG("[TEMP MEAS] Failed to read attribute %d",readRsp->attr[i].attrId);
        UTIL_LCD_ClearStringLine(3);
        UTIL_LCD_DisplayStringAt(0, LINE(3), (uint8_t *) "READ_CB ERR", CENTER_MODE);
        BSP_LCD_Refresh(0);
        LED_On(aPwmLedGsData);
        APP_Zigbee_Display_ErrorCnt();
      }
    }
  }
}/*APP_ZIGBEE_Temp_Meas_Read_cb*/

/**
 * @brief  Display error counter
 * @param  None
 * @retval None
 */            
static void APP_Zigbee_Display_ErrorCnt(void)
{
   char text[32];
   sprintf(text,"Error Cnt: %ld",APP_ZIgbee_Error_Cnt);
   UTIL_LCD_ClearStringLine(4);
   UTIL_LCD_DisplayStringAt(0, LINE(4), (uint8_t * ) text, CENTER_MODE);
   BSP_LCD_Refresh(0);
}/*APP_Zigbee_Display_ErrorCnt*/
            
            
/* Report management */

/**
 * @brief  report 
 * @param  cluster,dataind,attribute,datatype,datapayload,datalength
 * @retval None
 */
static void APP_ZIGBEE_Temp_meas_client_report(struct ZbZclClusterT *clusterPtr, 
                                               struct ZbApsdeDataIndT *dataIndPtr, 
                                               uint16_t attributeId,
                                               enum ZclDataTypeT dataType, 
                                               const uint8_t *in_payload,
                                               uint16_t in_len)
{
    int attrLen;
    uint16_t attr_val;
    int16_t temp_cur;
    float temp_val;
    char text[32]; 
    aPwmLedGsData_TypeDef aPwmLedGsData;
    
    attrLen = ZbZclAttrParseLength(dataType, in_payload, dataIndPtr->asduLength, 0);
    if (attrLen < 0)
    {
        APP_DBG("[TEMP MEAS] Report error length 0");
        APP_ZIgbee_Error_Cnt++;
        APP_Zigbee_Display_ErrorCnt();
        return;
    }
    if (attrLen > (int)in_len)
    {
          APP_DBG("[TEMP MEAS] Report error length >");
          APP_ZIgbee_Error_Cnt++;
          APP_Zigbee_Display_ErrorCnt();
          return;
    }
    if (dataIndPtr->src.endpoint!= SW1_ENDPOINT) 
    {
          APP_DBG("[TEMP MEAS] Report error wrong endpoint");
          APP_ZIgbee_Error_Cnt++;
          APP_Zigbee_Display_ErrorCnt();
          return;
    }
    
    
    switch(attributeId)
    {
      case ZCL_TEMP_MEAS_ATTR_MEAS_VAL:
        attr_val= pletoh16(in_payload);
        temp_cur = (int16_t)attr_val;
        APP_DBG("[From %016llx] - [TEMP MEAS]     %d C",dataIndPtr->src.extAddr,temp_cur);
        temp_val = (float) temp_cur/100;
        sprintf(text,"Rep.Rem T:%.1f C",temp_val);
        UTIL_LCD_ClearStringLine(3);
        UTIL_LCD_DisplayStringAt(0, LINE(3), (uint8_t *)text, CENTER_MODE);
        BSP_LCD_Refresh(0);
        aPwmLedGsData[PWM_LED_RED] = PWM_LED_GSDATA_OFF;
        aPwmLedGsData[PWM_LED_GREEN] = PWM_LED_GSDATA_OFF;
        aPwmLedGsData[PWM_LED_BLUE] = PWM_LED_GSDATA_7_0;
        LED_Toggle(aPwmLedGsData);
        break;
      
      default:
        APP_DBG("[From %016llx] - Reported another attribute %04X",dataIndPtr->src.extAddr,attributeId);
        APP_DBG("");
        break;
    }
 
} /* APP_ZIGBEE_temp_meas_client_report */

/**
 * @brief  report config 
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ReportConfig(void)
{
  uint16_t rep_change = (uint16_t) ZCL_REPORT_CHANGE;
  struct ZbZclAttrReportConfigT report;
  report.dst.endpoint = SW1_ENDPOINT;
  report.dst.mode = ZB_APSDE_ADDRMODE_SHORT;
  report.dst.nwkAddr = 0x0000;
  report.num_records = 1;
  report.record_list[0].min = ZCL_MIN_REPORT;
  report.record_list[0].max = ZCL_MAX_REPORT;
  report.record_list[0].change = 0;
  report.record_list[0].attr_id = ZCL_TEMP_MEAS_ATTR_MEAS_VAL;
  report.record_list[0].attr_type = ZCL_DATATYPE_SIGNED_16BIT;
  ZbZclAttrReportConfigReq(zigbee_app_info.temp_meas_client,&report,&APP_ZIGBEE_Report_cb,(void*)&rep_change);
}/*APP_ZIGBEE_ReportConfig*/

/**
 * @brief  report config callback
 * @param  cmdRsp,arg
 * @retval None
 */
static void APP_ZIGBEE_Report_cb(struct ZbZclCommandRspT *cmd_rsp,void *arg)
{
  if(cmd_rsp->status != ZCL_STATUS_SUCCESS)
  {
    APP_ZIgbee_Error_Cnt++;
    APP_DBG("[TEMP MEAS] Report Config Failed error:%d",cmd_rsp->status);
    APP_Zigbee_Display_ErrorCnt();
  }
  else
  {
    APP_DBG("[TEMP MEAS] Report Config set with success");
  }
}/*APP_ZIGBEE_Report_cb*/



/* LED Management */

/**
 * @brief  Deinit LED
 * @param  None
 * @retval None
 */
static void LED_Deinit(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure = {0};
  
  /* RGB Led de-init */
  BSP_PWM_LED_DeInit();

  /* configure SPIx MOSI for LCD */
  GPIO_InitStructure.Pin       = BUS_SPI1_MOSI_PIN;
  GPIO_InitStructure.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull      = GPIO_PULLDOWN;
  GPIO_InitStructure.Speed     = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStructure.Alternate = BUS_SPI1_AF;
  HAL_GPIO_Init(BUS_SPI1_GPIO_PORTA, &GPIO_InitStructure);
}/*LED_Deinit*/

/**
 * @brief  LED On
 * @param  PwmData
 * @retval None
 */
static void LED_On(aPwmLedGsData_TypeDef aPwmLedGsData)
{
  BSP_PWM_LED_Init();
  BSP_PWM_LED_On(aPwmLedGsData);
  LED_Deinit();
}/*LED_On*/

/**
 * @brief  LED off
 * @param  None
 * @retval None
 */
static void LED_Off(void)
{
  BSP_PWM_LED_Init();
  BSP_PWM_LED_Off();
  LED_Deinit();
}/*LED_Off*/

/**
 * @brief  LED Toggle
 * @param  PwmData
 * @retval None
 */
static void LED_Toggle(aPwmLedGsData_TypeDef aPwmLedGsData)
{
  if (BSP_PWM_LED_GetState() == 0U)
  {
    LED_On(aPwmLedGsData);
  }
  else
  {
    LED_Off();
  }
}/*LED_Toggle*/

/* USER CODE END FD_LOCAL_FUNCTIONS */


